#ifndef __hanzi_h
#define __hanzi_h

const unsigned char hanzi[][] =
    {
        {
            /*--  文字:  我  --*/
            /*--  宋体12;  此字体下对应的点阵为：宽x高=16x16   --*/
            0x20,
            0x24,
            0x24,
            0x24,
            0xFE,
            0x23,
            0x22,
            0x20,
            0x20,
            0xFF,
            0x20,
            0x22,
            0x2C,
            0xA0,
            0x20,
            0x00,
            0x00,
            0x08,
            0x48,
            0x84,
            0x7F,
            0x02,
            0x41,
            0x40,
            0x20,
            0x13,
            0x0C,
            0x14,
            0x22,
            0x41,
            0xF8,
            0x00,
        },
        {
            /*--  文字:  艹  --*/
            /*--  宋体12;  此字体下对应的点阵为：宽x高=16x16   --*/
            0x04,
            0x04,
            0x04,
            0x04,
            0x1F,
            0x04,
            0x04,
            0x04,
            0x04,
            0x04,
            0x1F,
            0x04,
            0x04,
            0x04,
            0x04,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
            0x00,
        },
};

void ShowCn(u16 x, u16 y, u8 size, u8 num, u8 mode);

#endif
